In [1]:
import os
# Set the working directory to your desired path
os.chdir(r'C:\Work\DS Study\G1\Data')

# Verify the change
print(os.getcwd())

C:\Work\DS Study\G1\Data

In [2]:
import pandas as pd
df = pd.read_csv("daily-minimum-temperatures-in-me.csv", header=0, index_col=0, parse_dates=True)

In [3]:
print(df)

           Daily minimum temperatures
Date
1981-01-01                       20.7
1981-01-02                       17.9
1981-01-03                       18.8
1981-01-04                       14.6
1981-01-05                       15.8
...                               ...
1990-12-27                         14
1990-12-28                       13.6
1990-12-29                       13.5
1990-12-30                       15.7
1990-12-31                         13

[3650 rows x 1 columns]

In [4]:
df.rename(columns={'Daily minimum temperatures':'min_temp'},inplace=True)
df

           min_temp
Date
1981-01-01     20.7
1981-01-02     17.9
1981-01-03     18.8
1981-01-04     14.6
1981-01-05     15.8
...             ...
1990-12-27       14
1990-12-28     13.6
1990-12-29     13.5
1990-12-30     15.7
1990-12-31       13

[3650 rows x 1 columns]

In [5]:
df['year'] = df.index.year
df['month'] = df.index.month
df['day'] = df.index.day

In [6]:
df

           min_temp  year  month  day
Date
1981-01-01     20.7  1981      1    1
1981-01-02     17.9  1981      1    2
1981-01-03     18.8  1981      1    3
1981-01-04     14.6  1981      1    4
1981-01-05     15.8  1981      1    5
...             ...   ...    ...  ...
1990-12-27       14  1990     12   27
1990-12-28     13.6  1990     12   28
1990-12-29     13.5  1990     12   29
1990-12-30     15.7  1990     12   30
1990-12-31       13  1990     12   31

[3650 rows x 4 columns]

In [9]:
df['t-1'] = df['min_temp'].shift(1)

In [11]:
df

           min_temp  year  month  day   t-1
Date
1981-01-01     20.7  1981      1    1  None
1981-01-02     17.9  1981      1    2  20.7
1981-01-03     18.8  1981      1    3  17.9
1981-01-04     14.6  1981      1    4  18.8
1981-01-05     15.8  1981      1    5  14.6
...             ...   ...    ...  ...   ...
1990-12-27       14  1990     12   27  14.6
1990-12-28     13.6  1990     12   28    14
1990-12-29     13.5  1990     12   29  13.6
1990-12-30     15.7  1990     12   30  13.5
1990-12-31       13  1990     12   31  15.7

[3650 rows x 5 columns]

In [13]:
df['t-2'] = df['min_temp'].shift(2)
df['t-3'] = df['min_temp'].shift(3)

In [15]:
df

           min_temp  year  month  day   t-1   t-2   t-3
Date
1981-01-01     20.7  1981      1    1  None  None  None
1981-01-02     17.9  1981      1    2  20.7  None  None
1981-01-03     18.8  1981      1    3  17.9  20.7  None
1981-01-04     14.6  1981      1    4  18.8  17.9  20.7
1981-01-05     15.8  1981      1    5  14.6  18.8  17.9
...             ...   ...    ...  ...   ...   ...   ...
1990-12-27       14  1990     12   27  14.6  12.9    10
1990-12-28     13.6  1990     12   28    14  14.6  12.9
1990-12-29     13.5  1990     12   29  13.6    14  14.6
1990-12-30     15.7  1990     12   30  13.5  13.6    14
1990-12-31       13  1990     12   31  15.7  13.5  13.6

[3650 rows x 7 columns]